["The view is simply mind-blowing, like a postcard scene. Unbeatable! Sipping coffee by the lake is pure heaven. Nature + fika = perfection. 😍🌲☕ …", "This beautiful cafe located on the water has delicious food, like soups and sandwiches, and pastries. It’s a great cafe to stop in at when out for a walk!", "My go to place when cycling around Lidingö. During the summer there are plenty of seats outside and the cafe is surrounded by nature making it a nice getaway from the busy center.", "Awesome cafe and bakery! Fresh and tasteful food and kindness service. Splendid location and plenty of space to chill and relax. Highly recommended!", "A mandatory stop every time we hike in Lidingö. Good service and excellent location. Food is good (love the Pesto toast!) and views from the outdoor tables are amazing, towards the lake.\n\nA good place for stoping in summer but also in winter as it’s even cosier with the snow!", "We found this cafe while walking around the lake and it’s such a gem. The coffee was brewed to perfection and the pastries were still warm from the oven. Staff was really friendly too!", "Amazing view and nice options for lunch.Really relaxing place next to water.", "Being here in a sunny warm day is hardily possible to make a bad review. The view is awesome, the stuff is friendly and there are a good amount of options in the menu. I can recommend the Caesar Salad and the Grilled Croissant. I’d say the price level is $$$ instead of $$ as it’s listed here.", "Loved the food and atmosphere😍🤤 …", "Beautiful spot by the lake. Seating outside on three sides and indoor seating (with tall ceiling that equals good air and really open feeling).\n\nGood and tasty food options and they make their own pastry. Take that and mix with wonderful staff and you get an great experience!", "The most cozy place I have ever been in stockholm , fast service! The salad bowl was incredibly tasty and fresh", "Friendly staff,  delicious food and coffee.\n\nOn premise bakery", "A favorite lunch - bakery place ! All their pastries are superb with a favorite carrot cake 🤤 . Amazing surroundings in the middle of the nature . Both during summer and winter you enjoy every small piece of it . …", "One of my favorite locations in Stockholm it’s a really cozy cafe in the forest with lots of hiking paths nearby, always enjoy the food and the service here and been here several times", "Great cafe with lovely atmosphere and fantastic views.", "Magnificent place for a coffee or breakfast", "We had lunch with our English speaking colleagues and took coffee to drink outside. The managers were watching us, probably us not being Swedes, they had a sarcastic attitude towards me when trying to go back to the restaurant and had a very unpolite approach when a colleague tried to serve us outside the restaurant with some home baked cookies. I recommend managers to hang an announcement \"Non-Swedes not welcome!\". For confirmation, as well as for apologies, I am available. Otherwise, the staff is very nice and the food is good. Gabriel", "Cozy beautiful place, average food and small menu, nice personal and unfriendly management towards non-Swedish speaking customers.", "Great place to chill with good sandwiches or salads. Near nature ❤️✨️🙏🏻 …", "Always very friendly staff who provide quality service very promptly. Amazing location and very nicely styled place. The food has always been very good, as is the coffee. Parking seems a bit limited but as we go off peak times it's never been an issue for us.", "Delicious carrot cake and great coffee. Very cool atmosphere and interior with an array of tasty looking buns. The building itself is quite pretty, orange brick contrasting with the forested setting. Set in a picturesque location next to a (currently) frozen lake with ice skaters taking laps.", "Great food, friendly and service minded staff, beautiful location! Warmly recommended!!", "After being trusty clients to the lidingö bröd&pattiserie, we decided to try this place since we live near by. Absolutely amazing! Fresh  breads, croissants, pain au chocolate to die for. Perfect to visit after a long walk. Dare I say this place is actually better than lidingö bröd?", "A really good cafe with a lot of delicious home made bakery, salads and other good food. The setting next to Kottla lake is just beautiful and invites for a promenade.\nThe personnel is very personal and nice which guarantees for a great meal and visit.", "really nice cafe with good food and healthy drinks. Feels nice to be in the woods", "Beautiful old building renovated excellently & set in a fantastic location right on the lake. Lovely selection of food & drinks. There was nothing on the lunch menu that was vegan, however, when I asked one of the staff very kindly made me a delicious salad. Highly recommended.", "We really like this place, is cozy and beautiful. All bakery and bread is done there so is fresh and delicious!!", "Great spot for some Fika and a nice walk around Kottla Lake", "Truly amazing! Great lunch and cafe place with a really nice patio.", "Lovely place with very delicious pastries and fika bröd. I tried carrot cake which was insanely delicious. Hot chocolate was also good. I will surely visit the place again.", "This cafe is a little gem. The view and atmosphere is amazing. Coffee is good and the cinnamon rolls are delicious. Would recommend.", "Nice and cozy place! We had dinner buffè with the company so i can't really rate the place fair. Very nice staff and delicous pastries for dessert!", "Great Food, coffe, Staff and surrounding. I really appreciate the autumn here. Sitting outside in company of leaves turning red and yellow. Bring a blanket or sit inside.", "Super cozy place woth fresh baked bread and good coffee. Nature around the cafe is just wonderful for any seasons.", "Beautiful place next to the lake. Very cozy, nice music, good food and great coffee. Perfect for a stop when you’re biking in the area.", "Great staff\nGreat food\nThe brew is nice and strong, leaves no one unnoticed.", "Great place to lunch after a hike", "Excellent spot for good quality food and nice swimming and SUP in the lake. Highly recommend it even on an overcast day - cosy inside too!", "Very nice place for fika!", "Nice place by Kottlasjön. Note that they have limited opening hours. Don't forget to try the local beers that are brewed in the basement.", "Fantastic place❣Beautiful location and Building! Bread, Sweets and Coffe to Die for❣ Lovely Stsff and Owner❣❣Just Go There❣", "Excellent and cosy location. Food is much better than in previous management, but salads could use some sauces. Friendly staff!", "Very scenic café, not too far from city center with excellent pastry and sandwiches", "Highly recommend. Fantastic location, freshly baked food, very friendly staff and management. Amazing discovery.", "Delicious pastries and breads.\nThe pumpkin and chia seeds crispbread is to die for!!", "The new owners have turned around this cafe from an under par to above par cafe with truly excellent pastries and bread.", "First visit. Nice staff, great coffee and delicious bread.", "Amazing food and ”fika” in a truly beautiful setting.", "This was a dream place when you want to take a long walk and fika at the end", "Nice, beautiful location with fresh and tasty snacks.", "Beautiful place overlooking the lake. Cqke was delicious", "Very nice place... Very good caffe... and bule.... Friendly staff.", "Beautiful atmosphere and delicious carrot cake 😍 …", "Lovely cafe on the water with amazing kanelbullar.", "Tasty food and beautiful views!", "Magical place, and bakery", "Great location, building and own beers.", "A bit on the pricier side but definitely worth it", "Nice food, nice location.", "Amazing place !", "Awesome", "Thanks :-)", "Bra croissant.", "Amazing place", "ALL Cons:\n➖ Stressed staff\n\n➖Have no idea what people order, charged extra for a bun I never ordered. (Discovered at home)\n\n➖ The cardamom bun tasted like air, amazing when a bakery makes these?\n\n➖The salad was tasteless, would have just as easily eaten grass on the ground that would have tasted better.\n\n➖When I went to pick up the food, they say I should pick up 5 dishes..\n\nThey have no idea what people order, stressed and messy.\n\nAbsolutely deplorable that they don't listen to customers and charge for things you didn't order.\n\nParking is incredibly hard to come by.\n\nWon't be coming back.\n\nVERY DISSATISFIED!", "A fantastically beautiful brick building with several small rooms where you can sit close to nature outside the window with a lake view. Fantastic home-baked sourdough bread, cakes and buns are served here. Now during the summer months there are many lovely little sitting areas under the trees with the forest close in. The waterworks is located right on Lake Kapplasjön where you can see and hear the splashing of people bathing.", "Very cozy place that is a bit hidden on Lidingö. Close to the water, many seats both inside and outside. Nice staff who worked :) we bought quinoa salad with chicken feta and avocado and a grilled ciabatta with avocado/chicken, however, the ciabatta was quite tasteless, but it was solved with a little salt and pepper. Next time it will be salad with chèvre & spinach toast (this one looked really good)! We also bought buns to take home, but they weren't baked enough, so we put them in the oven for a few minutes and it was perfect!\nThe iced coffee was now suitable for the summer 👌🏼\n\nRecommended!\n\nThe place can also be rented for private events.", "What a place, one of the coziest cafes I've been to in a long time, great, happy, friendly and welcoming staff who really chatted and told nice things about the waterworks. Fun interior was in green brown and New Age, you felt at home. Beautiful outdoor seating. Super nice bread with more butter in the buns than anything else, my companion enjoyed the blueberry bun full of cream and tartness. My chocolate chip was a bit hard and sad but good.\n\nBasically everything was right, and not because there was anything wrong with the preparation of the latte (perhaps the knife and scale for the grinder should be adjusted) but it tasted far too little caffe for a full pot.\n\nThank you for a lovely coffee\n\n20220703\nStill the same nice place, we were both at 12 o'clock and 3 o'clock, it was noticeable that the Service team had a lot to do and started to do a little worse work, and so the alleri folder needs to be updated, I refrained from testing something that looked good, because he needed to call and the line was too long.", "Wonderful place next to Kottlasjön on Lidingö. Freshly baked bread for sale, coffee, lunch - everything to the highest standard. Nice walking paths in Långängen-Elfviks Nature Reserve. Worth a detour!", "Cozy place, probably even better if the sun is shining and you can sit outside again 🙂\nMasty shrimp sandwich on rye bread. Will be back to try some pastries too. …", "Good food, nice environment, friendly staff.", "I thought it was a bit expensive and it turned out that we paid for a cake that costs SEK 65, although we bought a bun for SEK 40. Of course I thought it just happened to go wrong until I read the comments of others below who \"happened\" to the same mistake. Not okay and want to warn others.", "Plus for very nice location by the water and nice renovation. Beautiful walking paths. Cozy little playhouses for the children. Could be really good for a party. Poppis for dog owners.\n\nMinus for the food, the food selection, the service and the coffee. There you need to make more of an effort. If you don't like barking dogs (80% have dogs and they tend to bark without the owner noticing) it also ends up on the minus list.", "What a gem!! Super nice staff despite full roll and lots of people. Very good salads, sandwiches with salad. But the cinnamon buns are amazingly fresh and good, next time I'm going to pop them. Many different seats both inside and outside, by the water or a little above. Fits great if the doggie is with you.", "Such a nice cafe, and a nice swimming area, but my gluten allergic son got so sick after eating a gluten-free cake there. Perhaps gluten-free enough for those who avoid gluten but not at all for those with allergies. (Which they said would be safe when I asked)", "Cozy cafe or place for lunch. Been here many times and am always equally satisfied with the visit. Good buns and good dishes. Feel free to combine with a lap around Kottla on a sunny day. Dogs are not welcome indoors but of course outdoors.", "Cozy place, good coffee...but don't visit the toilet 🤢horribly dirty. Hope the kitchen and bakery are cleaned better …", "Very nice place. I had my dog with me and sat in their nice garden. Good coffee and really good pastries! Lots of people in the middle of the day on a Monday! Quiet and close to the lake, in the forest! Good with seats and not crowded. Maybe not the cheapest place, hence not full 5 ☆.", "The setting is magnificent, the food is good. You can access it in winter via the frozen lake, which makes the adventure even more magical! The waiters are very friendly, you can even sit in a lounge alone or in a group with a view of the lake.", "What a hidden gem in the middle of the forest and such good quinoa kale and hot salmon salad we also ate! A must to take the \"detour\" here if you are out for a walk anyway. Thanks!", "Cozy and really nice Cafe with home-baked and fast service and nice staff ⭐⭐⭐⭐", "Super cozy place that is open all year round", "Wonderful and cozy place with good food and superb service! Strongly recommend booking private parties or conferences here.", "Quite ok but no more. Thin coffee, nice bun and quite rubbish all around.", "Good pea soup, good beer and nice service. Very nice view of Kottlasjön with. Well worth a visit!", "Lovely breakfast by the water while the car is being fixed at the workshop. Wonderful location and best levain and French pastries on the island.", "OK. The outdoor seating, which faces the lake, is in the shade all day, except after closing. Bit of a shame.\n\nInside, the ceiling is high, it could be a little cozier.", "Pleasant environment. Fresh dishes and freshly baked buns. I will be back.", "Nice atmosphere and good food/coffee.", "Always good coffee and cozy place. Today, however, it was one of the staff (of an older model) who must have woken up on the wrong side. He was snooty and unpleasant. Many guests reacted to his annoying/stressful way of dealing with guests.", "Good bread, good coffee, friendly staff in an environment that beats most."]